## Big Data Engineer

## Assigntment 1: Hotel reviews

In [1]:
import datapreparation as dp
import db as db
import datacleaning as dc

In [2]:
df_kaggle = dp.return_df()
df_kaggle.head()

                                              review  rating
0   Only the park outside of the hotel was beauti...       1
1   No real complaints the hotel was great great ...       1
2   Location was good and staff were ok It is cut...       1
3   Great location in nice surroundings the bar a...       1
4    Amazing location and building Romantic setting        1

In [3]:
df_tripadvisor = dp.return_df_tripadvisor()
df_tripadvisor.head()

                                              review  rating
0  This hostel was beautiful, clean, lots of spac...       0
1  There are many beds in the room. Not that clea...       1
2  Shower had waves of hold and cold water. Staff...       1
3  my friends and I left Rome and we had a great ...       1
4  I loved the style of this hostel, but I've bee...       1

In [4]:
df_booking = dp.return_df_booking()
df_booking.head()

                                              review  rating
0  Gorgeous everything, atmosphere, accommodation...       1
1  Awesome place! Really clean, nice beds and ove...       1
2      Lights of the toilet turning off all the time       0
3   The breakfast was expensive, so we didn't buy it       1
4                 Quiet but lively at the same time.       1

In [5]:
df_add = dp.return_df_add()
df_add.head()

                                              review  rating
0  I dont like this hotel, the sheets where dirty...       0
1  I like this hotel, I slept very well and every...       1

In [6]:
dataframes = [df_kaggle, df_tripadvisor, df_booking, df_add]

df = dp.return_df_final(dataframes)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1031628 entries, 0 to 1031627
Data columns (total 2 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   review  1031628 non-null  object
 1   rating  1031628 non-null  int64
dtypes: int64(1), object(1)
memory usage: 15.7+ MB

In [7]:
df = db.return_db_from_mysql()
df.head()

MySQL connection is closed

                                                   0  1
0   The only thing that wasn t perfect was that t...  0
1                                      Bed too small  0
2   Good location Whilst the evening staff weren ...  1
3   Great location and this hotel is like a museu...  1
4   Good quality of service The staff is really w...  1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 849688 entries, 0 to 849687
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       849688 non-null  object
 1   1       849688 non-null  int64
dtypes: int64(1), object(1)
memory usage: 13.0+ MB

In [9]:
df = df.rename(columns = {0:'review', 1:'is_positive'})

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [11]:
dc.show_info(df)

Percentage of positive and negative reviews:
 1    0.5631
0    0.4369
Name: is_positive, dtype: float64


Longest review:  1966


Shortest review:  1

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 849688 entries, 0 to 849687
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       849688 non-null  object
 1   1       849688 non-null  int64
dtypes: int64(1), object(1)
memory usage: 13.0+ MB